update topologi
